
** With Nix shell you can do things like:
   #+NAME: basic-shell
   #+BEGIN_SRC nix :json t
     let
       pkgs = import <nixpkgs> {};
     in "${pkgs.mkShell {
         name = "My shell 3";
         buildInputs = with pkgs; [
           git
           curl
         ];
         shellHook = ''
           echo "Welcome to my shell";
               '';
     }}"
   #+END_SRC
   #+RESULTS: basic-shell
   : "/nix/store/0fanqs3pv0md8d658m9d52qd1fwxpvv0-My-shell-3"

